03 RESPONSE PIC S9(8) BINARY.
03 EXITKEY PIC X.

EXEC CICS RECEIVE MAP(MAPNAME)
MAPSET('ACCOUNT')
INTO(MAP)
RESP(RESPONSE)
END-EXEC.
IF (RESPONSE NOT = DFHRESP(NORMAL)) AND
(RESPONSE NOT = DFHRESP(MAPFAIL))
MOVE DFHCLEAR TO EXITKEY
ELSE
MOVE EIBAID TO EXITKEY
IF RESPONSE = DFHRESP(NORMAL)
GO TO MODIFYMAP
END-IF
END-IF.

MODIFYMAP